# POSTTEST 4 Praktikum Kecerdasan Buatan
---
*2109106063* - Zahra Salsabila - B121

In [1]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import OrdinalEncoder, OneHotEncoder
from sklearn.preprocessing import StandardScaler

### Melihat Data Sebelum Dilakukan *Data Processing*

In [2]:
df = pd.read_csv("Test.csv")
df.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,458989,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6,B
1,458994,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6,A
2,458996,Female,Yes,69,No,NaN,0.0,Low,1.0,Cat_6,A
3,459000,Male,Yes,59,No,Executive,11.0,High,2.0,Cat_6,B
4,459001,Female,No,19,No,Marketing,NaN,Low,4.0,Cat_6,A

### Melakukan *Data Cleaning* Pada Data

- #### Melihat attribut data dengan nilai null

In [3]:
df.isnull().sum()

ID                   0
Gender               0
Ever_Married        50
Age                  0
Graduated           24
Profession          38
Work_Experience    269
Spending_Score       0
Family_Size        113
Var_1               32
Segmentation         0
dtype: int64

Dari data di atas, dapat diketahui bahwa nilai null terdapat pada attribut **Ever_Married** dengan tipe data text, **Graduated** dengan tipe data text, **Profession** dengan tipe data text, **Work_Experience** dengan tipe data float, **Family_Size** dengan tipe data float, dan **Var_1** dengan tipe data text.

- #### Mengganti nilai null pada attribut bertipe data float (Work_Experience & Family_Size) dengan nilai mean

In [13]:
# Membuat imputer untuk mengganti nilai null pada attribut dengan nilai mean
float_imputer = SimpleImputer(missing_values = pd.NA, strategy = 'mean')
df[['Work_Experience', 'Family_Size']] = float_imputer.fit_transform(df[['Work_Experience', 'Family_Size']])

In [14]:
df.isnull().sum()

ID                  0
Gender              0
Ever_Married       50
Age                 0
Graduated          24
Profession         38
Work_Experience     0
Spending_Score      0
Family_Size         0
Var_1              32
Segmentation        0
dtype: int64

- #### Mengganti nilai null pada attribut bertipe data text (Ever_Married, Graduated, Profession, & Var_1) dengan nilai modus

In [15]:
# Membuat imputer untuk mengganti nilai null pada attribut dengan nilai modus
text_imputer = SimpleImputer(missing_values = pd.NA, strategy = 'most_frequent')
df[['Ever_Married', 'Graduated', 'Profession', 'Var_1']] = text_imputer.fit_transform(df[['Ever_Married', 'Graduated', 'Profession', 'Var_1']])

In [16]:
df.isnull().sum()

ID                 0
Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
Segmentation       0
dtype: int64

- #### Melihat nilai duplikat pada data

In [17]:
print('Jumlah nilai duplikat pada data: ')
df.duplicated().sum()

Jumlah nilai duplikat pada data:

7

- #### Menghapus nilai duplikat pada data

In [18]:
df.drop_duplicates(inplace=True)

In [19]:
print('Jumlah nilai duplikat pada data sekarang: ')
df.duplicated().sum()

Jumlah nilai duplikat pada data sekarang:

0

### Membagi Dataset Menjadi *Training Set* dan *Testing Set* dengan proporsi 70:30

- #### Memisahkan X dan Y

In [20]:
X = df.iloc[:, :-1]
y = df.iloc[:, -1]

In [21]:
X

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,458989,Female,Yes,36,Yes,Engineer,0.000000,Low,1.0,Cat_6
1,458994,Male,Yes,37,Yes,Healthcare,8.000000,Average,4.0,Cat_6
2,458996,Female,Yes,69,No,Artist,0.000000,Low,1.0,Cat_6
3,459000,Male,Yes,59,No,Executive,11.000000,High,2.0,Cat_6
4,459001,Female,No,19,No,Marketing,2.553911,Low,4.0,Cat_6
...,...,...,...,...,...,...,...,...,...,...
2622,467954,Male,No,29,No,Healthcare,9.000000,Low,4.0,Cat_6
2623,467958,Female,No,35,Yes,Doctor,1.000000,Low,1.0,Cat_6
2624,467960,Female,No,53,Yes,Entertainment,2.553911,Low,2.0,Cat_6
2625,467961,Male,Yes,47,Yes,Executive,1.000000,High,5.0,Cat_4
2626,467968,Female,No,43,Yes,Healthcare,9.000000,Low,3.0,Cat_7

In [22]:
y

0       B
1       A
2       A
3       B
4       A
       ..
2622    B
2623    A
2624    C
2625    C
2626    A
Name: Segmentation, Length: 2627, dtype: object

- #### Split data menjadi *training set* dan *test set* dengan proporsi 70:30

In [23]:
X_train,X_test, y_train, y_test = train_test_split(X, y, test_size = 0.3)

print('X_train : ', X_train.shape)
print('X_test  : ', X_test.shape)
print('y_train : ', y_train.shape)
print('y_test  : ', y_test.shape)

X_train :  (1838, 10)
X_test  :  (789, 10)
y_train :  (1838,)
y_test  :  (789,)

### Normalisasi Data

- Copy Dataset

In [24]:
df_copy1 = df.copy()

- Melakukan normalisasi data pada attribut Work_Experience menggunakan Min Max Scaler

In [25]:
scaler = MinMaxScaler()
df_copy1['Work_Experience'] = scaler.fit_transform(df_copy1[['Work_Experience']])

In [26]:
df_copy1[['Work_Experience']]

      Work_Experience
0            0.000000
1            0.571429
2            0.000000
3            0.785714
4            0.182422
...               ...
2622         0.642857
2623         0.071429
2624         0.182422
2625         0.071429
2626         0.642857

[2627 rows x 1 columns]

### Standarisasi Data

- Copy Dataset

In [27]:
df_copy2 = df.copy()

- Standarisasi pada dataset

In [28]:
ss = StandardScaler()
df_copy2[['Age', 'Work_Experience', 'Family_Size']] = ss.fit_transform(df_copy2[['Age', 'Work_Experience', 'Family_Size']])

In [29]:
df_copy2[['Age', 'Work_Experience', 'Family_Size']]

           Age  Work_Experience  Family_Size
0    -0.450948        -0.806613    -1.202636
1    -0.391999         1.721238     0.773831
2     1.494372        -0.806613    -1.202636
3     0.904881         2.669183    -0.543814
4    -1.453083         0.000376     0.773831
...        ...              ...          ...
2622 -0.863592         2.037220     0.773831
2623 -0.509897        -0.490631    -1.202636
2624  0.551187         0.000376    -0.543814
2625  0.197492        -0.490631     1.432653
2626 -0.038305         2.037220     0.115009

[2627 rows x 3 columns]

### Mengganti Tipe Data Attribut Family_Size (Float) dengan Tipe Data Boolean Menggunakan *One Hot Encoding*

In [30]:
df.Family_Size.value_counts()

2.000000    768
1.000000    512
3.000000    455
4.000000    444
5.000000    200
2.826656    113
6.000000     78
7.000000     26
9.000000     16
8.000000     15
Name: Family_Size, dtype: int64

In [36]:
# Mengubah tipe data attribut menjadi string terlebih dahulu
df['Family_Size'] = df['Family_Size'].astype(str)
# Melakukan one hot encoding pada attribut Family_Size
FS_enc = pd.get_dummies(df[["Family_Size"]])
df = df.join(FS_enc)

In [41]:
df.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,...,Family_Size_1.0,Family_Size_2.0,Family_Size_2.8266560888536296,Family_Size_3.0,Family_Size_4.0,Family_Size_5.0,Family_Size_6.0,Family_Size_7.0,Family_Size_8.0,Family_Size_9.0
0,458989,Female,Yes,36,Yes,Engineer,0.000000,Low,1.0,Cat_6,...,1,0,0,0,0,0,0,0,0,0
1,458994,Male,Yes,37,Yes,Healthcare,8.000000,Average,4.0,Cat_6,...,0,0,0,0,1,0,0,0,0,0
2,458996,Female,Yes,69,No,Artist,0.000000,Low,1.0,Cat_6,...,1,0,0,0,0,0,0,0,0,0
3,459000,Male,Yes,59,No,Executive,11.000000,High,2.0,Cat_6,...,0,1,0,0,0,0,0,0,0,0
4,459001,Female,No,19,No,Marketing,2.553911,Low,4.0,Cat_6,...,0,0,0,0,1,0,0,0,0,0